### Concat Dataframes

###

- Joins 2 dataframes together

Syntax:   

        pd.concat([dataframe_1, dataframe_2])

- Contains an arguement ignore_index so that indexes don't get concatenated; False by default

In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    
    'city' : ["mumbai", "delhi", "banglore"],
    'temperature' : [23, 45, 30],
    'humidity' : [80, 60, 78]
    
})
india_weather

       city  temperature  humidity
0    mumbai           23        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    
    'city' : ["new tork", "chicago", "orlando"],
    'temperature' : [21, 14, 35],
    'humidity' : [68, 65, 75]
    
})
us_weather

       city  temperature  humidity
0  new tork           21        68
1   chicago           14        65
2   orlando           35        75

In [9]:
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           23        80
1     delhi           45        60
2  banglore           30        78
3  new tork           21        68
4   chicago           14        65
5   orlando           35        75

###

- concat also has keys attribute that specifies different data frames

- Using keys arguement, we can get subset of our dataframe

In [11]:
df = pd.concat([india_weather, us_weather], keys = ['India', 'US'])
df

             city  temperature  humidity
India 0    mumbai           23        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new tork           21        68
      1   chicago           14        65
      2   orlando           35        75

In [12]:
df.loc['India']

       city  temperature  humidity
0    mumbai           23        80
1     delhi           45        60
2  banglore           30        78

In [14]:
df.loc['US']

       city  temperature  humidity
0  new tork           21        68
1   chicago           14        65
2   orlando           35        75

###

- Making new dataframe append as columns instead of rows

- In order to do this, we'll use axis arguement

- when axis = 0, df is appended as rows but when axis = 1, df is appended as columns

- By default axis = 0

In [17]:
temperature_df = pd.DataFrame({
    
    'city' : ["mumbai", "delhi", "banglore"],
    'temperature' : [32, 45, 30],
    
})

temperature_df

       city  temperature
0    mumbai           23
1     delhi           45
2  banglore           30

In [18]:
windspeed_df = pd.DataFrame({
    
    'city' : ["mumbai", "delhi", "banglore"],
    'windspeed' : [7, 12, 9],
    
})

windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         12
2  banglore          9

In [20]:
df = pd.concat([temperature_df, windspeed_df], axis = 1)
df

       city  temperature      city  windspeed
0    mumbai           23    mumbai          7
1     delhi           45     delhi         12
2  banglore           30  banglore          9

###

- Index arguement

- Used to align rows from different dataframes

Syntax:

        dataframe = pd.Dataframe({

                'column_name' : ['value1', 'value2',...],
                'column_name' : ['value1', 'value2',...]

        }, index = [number_1, number_2, number_3])

In [26]:
temperature_df = pd.DataFrame({
    
    'city' : ["mumbai", "delhi", "banglore"],
    'temperature' : [32, 45, 30],
    
}, index = [0,1,2])

temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [27]:
windspeed_df = pd.DataFrame({
    
    'city' : ["delhi", "mumbai"],
    'windspeed' : [7, 12],
    
}, index = [1,0])

windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [28]:
df = pd.concat([temperature_df, windspeed_df], axis = 1)
df

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN

###

- Joining dataframe from series

In [29]:
s = pd.Series(["Humid", "Dry", "Rain"], name = "event")

In [31]:
df = pd.concat([temperature_df, s], axis = 1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain